content-org/website.org
#+HUGO_BASE_DIR: ~/Documents/almoszediu-website
#+HUGO_FRONT_MATTER_KEY_REPLACE: author>nil

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
** DONE Snowpiercer (2020) :impressions:
:PROPERTIES:
:EXPORT_FILE_NAME: snowpiercer
:EXPORT_DATE: 2020-07-22
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featuredImage "/images/pikrepo.com.jpg"
:END:
Bong Joon Ho has definitely brought some fresh and new perspectives into
Hollywood, as seen in his latest movie, Parasites, but many of us have known his
other great work Snowpiercer, which has also stirred some still waters, back
in 2013.

THIS REVIEW CONTAINS SPOILERS! You have been warned.

*** Synopsis
The premise is quite unique, and thought provoking, in and on itself: global
warming has become so rampant, that the scientists of Earth have decided that
the only solution to stopping it is artificially cooling down our planet with
the use of a special chemical which they released into the atmosphere. They
succeeded, but they were "winning too much" and actually cooled the Earth down
to such an extent that life has become threatened by a new and extreme Ice Age.
The last remnants of humanity boarded a train called the Snowpiercer, built by
millionaire genius Wilford, but the price of admission meant that only the very
rich could afford a ticket to salvation. Unfortunately neither the movie, nor
the series explains the significance of their wealth in a society without banks,
companies or stock markets, but unfortunately this is but the smallest
inconvinience.

The base of the Netflix adaptation remains the same, but fortunately the plot
differs quite a lot. I don't mean that it's better, in fact I'm going to make a
point of it that it's not, but at least the showrunners didn't give us a remake
of a mere seven year old movie. They delivered instead a rather entertaining but
woefully mediocre television series about solving crimes, getting betrayed,
being beaten up and making grand unnecessary speeches. You know the drill folks.

*** Ideology vs cheap symbolism
Soo... the idiological flames of the original movie were handed over to Netflix,
but do the fires of Vesta still burn? It could be sad, that the series tackles
societal issues, the divide between rich and poor and unprecendented corporate
and individual greed. The problem with this is the main  problem that permeates
the whole season: shallowness. The opposing factions are strawmanned essentially,
with one  dimensional motivations and moral compasses. The Tailies apart from
Trevor from GTA V are all noble and fraternal people, and the First Class
passangers are essentially a parody of oligarch, out of touch elites who can
only complain, boast about their wealth, and play pitiful mini-politics between
each other.

At the end of the season, Layton's revolution becomes succesful, but not without
heavy casualties. It really bothered me, that shots showing the bloodbath in the
Nightcar were overly long, and even slowed down, jumping from person to person as if the director screamed at
us: "LOOK AT THE HORRORS OF WAR! LOOK AT THEIR SUFFERING! LOOK HOW SAD THE
HEROES ARE!". It honestly would have had a much more profund impact on me, if
the camera zoomed out for a few seconds, and showed the battlefield as a morbid
still life. Show, don't tell!

*** Acting
The problem is further deepened by the fact that the lead actor who plays Andre
Layton ([[https://www.imdb.com/name/nm4377526/?ref_=tt_cl_t2][Daveed Diggsk]]) is simply uninspiring as a leader. A good example for
this would be the scene in which he has to sacrifice the imprisoned Tailies in
order to save the rest of the train. He looked and acted more like a confused
child who tries to lie to his mother, than a determined but morally conflicted
leader.

Luckily this couldn't be said about [[https://www.imdb.com/name/nm0000124/?ref_=tt_cl_t1][Jennifer Connelly]], who delivers a believable
and likable character, whose humanity is much more apparent than the artificiality
of Daveed. She maintains the illusion of control, and is empathetic towards the
passangers, but is actually capable of necessary sacrifice and does not hesitate
to act. Miles ahead of the Mary Sue-like Layton, who flies from girl-to-girl
like an overdosed butterfly gives drier speeches than the Dead Sea.

As for the rest of the cast... well they deliver their generic characters in a
generic, but acceptable way. It ain't much, but it's honest work. One notable
exception would be [[https://www.imdb.com/name/nm2399383/?ref_=tt_cl_t12][Annalise Basso]], who played the morbid and spoilt LJ. She
shows many sides of the teen psyche and you often can't decide whether to hate
her, pity her or laugh with/at her. An actually well thought-out and developed
side character whose scenes were enjoyable and well acted.

*** The plot justifies the deeds...
If you ask me what the greatest sin of mass-produced Hollywood cinematography
is, this would be my first pick. Plot driven characters feel unnatural,
dishonest to themselves and the viewer and are very-very cheap.

Why did Layton
act towards Zarah as a slightly disgruntled friend, after she DIRECTLY pointed
out his love to the Jackboots, which resulted in her death?

When did Trevor from
GTA V become such a scheming snake when he was the most stubborn fighting
machine beforehand? Don't get me wrong, I don't expect characters to don't
develop, but this kind of sudden jumps in character development takes me out of
the immersion, and reminds me that I'm watching a TV Show, and I don't like
being reminded of the fact. If he wouldn't have been quite literally "put on
ice", for much of the season,  his arc would have made an interesting caveat.
Because it's easier to write a story with Deus Ex Bainfreezer, that is why!

*** Visuals
Finally, something redeemable! Being a small-budget first season Netflix show,
it didn't have much cash to burn on CGI which explains the relatively few
outside shots, but at least they don't feel very-very cheap. The interior
decorations looked majestic and the series as a whole is very "sci-fi looking".
My only complaint regarding this side of the story would be the cringe-worthy
comic book style introductions, with low FPS. Just because you include some
drawn frames, it doesn't become more edgy or artistic.
*** Conclusion
It seems like that I hated this show, but it really isn't the case. I just
expected more from it, and didn't meet my expectations after the masterfully
directed film with the same  title. The story, despite being forced on it's poor
subjects, was actually compelling, and I'm looking forward to find out info
about the supply train. It will remain my brain fast-food between binging more
demanding titles.

